#!/bin/bash
#####		一键Ping测试			#####
#####		Author:xiaoz.me			#####
#####		Update:2017-12-18		#####

num=0
#Ping次数
pnum=20

location=(
	'四川 电信'
	'北京 电信'
	'北京 联通'
	'北京 移动'
	'上海 移动'
	'上海 电信'
	'上海 联通'
	'广东 电信'
	'广东 联通'
	'广东 移动'
)

dnsip=(
	'125.64.38.178'		#四川 电信
	'106.120.243.142'	#北京 电信
	'103.254.70.52'		#北京 联通
	'218.205.152.14'	#北京 移动
	'117.131.14.202'	#上海 移动
	'211.144.205.58'	#上海 电信
	'220.196.42.133'	#上海 联通
	'121.11.69.135'		#广东 电信
	'27.40.0.30'		#广东 联通
	'211.139.129.222'	#广东 移动
)

echo "测试中..."
echo '-------------------------------------------'

while(( $num<10 ))
do
	ping ${dnsip[$num]} -c $pnum > /tmp/${dnsip[$num]}.txt
	echo 【${location[$num]}】 - ${dnsip[$num]}
	tail -2 /tmp/${dnsip[$num]}.txt
	echo '-------------------------------------------'
	let "num++"
done

echo "min:最低延迟"
echo "avg:平均延迟"
echo "max:最高延迟"
echo "mdev:平均偏差"

echo '-------------------------------------------'